Revit 2017 API
Application.Assets Property
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public AssetSet this[
	AssetType A_0
] { get; }
Visual Basic
Public ReadOnly Property Assets ( _
	A_0 As AssetType _
) As AssetSet
	Get
Visual C++
public:
property AssetSet^ Assets[AssetType A_0] {
	AssetSet^ get (AssetType A_0);
}
Parameters
A_0
Type: Autodesk.Revit.Utility.AssetType
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace